InstallRoot.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Installing Root6 on Ubuntu-type linux</title>
<!-- 2015-10-27 Tue 12:39 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Richard Longland" />
</head>
<body>
<div id="content">
<h1 class="title">Installing Root6 on Ubuntu-type linux</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This short guide should get you set up for a relatively pain free
root6 installation. It used cmake for the installation, which
turns out to be quite convenient!
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Prerequisites</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Install from packages using this command:
<div class="org-src-container">

<pre class="src src-sh">sudo apt-get install &lt;package_name&gt;
</pre>
</div>
<ul class="org-ul">
<li>emacs
</li>
<li>build-essential
</li>
<li>libgsl0-dev
</li>
<li>libxerces-c-dev
</li>
<li>libcoin80-dev
</li>
<li>libglu1-mesa-dev
</li>
<li>cmake
</li>
<li>libexpat1-dev
</li>
<li>libinventor1
</li>
<li>magit
</li>
<li>libxft-dev
</li>
<li>libxml2-dev
</li>
<li>libmotif-dev
</li>
<li>libqt4-dev
</li>
<li>libqt4-opengl-dev
</li>
<li>tk
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Preparation</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>I like to put things like geant4 and root in the /opt
directory. It makes them system-wide and easier to separate from
the other junk in your home folder.
</li>
<li>You need to change the privileges to allow your user (<code>longland</code>
in my case)
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b0c4de;">cd</span> /opt
sudo mkdir root
chown -R longland:longland root
</pre>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Download the root code</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>I'm using version 6.04.06
</li>
<li>Get it <a href="https://root.cern.ch/download/root_v6.04.06.source.tar.gz">here</a>
</li>
<li>Unzip. We'll put it in that <code>opt</code> directory we made earlier
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b0c4de;">cd</span> /opt/root
mv downloaded-root-file.tar.gz .
tar -xzvf downloaded-root-file.tar.gz
</pre>
</div>
</li>
<li>This should have created a <code>root-6.04.06</code> folder. I'll rename it:
<div class="org-src-container">

<pre class="src src-sh">mv root-6.04.06 root-6.04.06-src
</pre>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Build</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Here's how it'll work
<ol class="org-ol">
<li>Make a build directory
</li>
<li>Use cmake to prepare the build directory
</li>
<li>Build root (compile it)
</li>
<li>Install the useful stuff in <i>yet another</i> folder - the install
directory.
</li>
</ol>
</li>
<li>So: let's do steps 1 and 2
<div class="org-src-container">

<pre class="src src-sh">mkdir root-6.04.06-build/
<span style="color: #b0c4de;">cd</span> root-6.04.06-build/
cmake -DCMAKE_INSTALL_PREFIX=/opt/root/root-6.04.06-install/<span style="color: #ffa07a;">\</span>
      ../root-6.04.06-src
</pre>
</div>
</li>
<li>Note: This command told root to install the compiled code in our
install directory
(<code>-DCMAKE_INSTALL_PREFIX=/opt/root/root-6.04.06-install</code>)
For more build options, see the root documentation
</li>
<li>Almost there. Now's time to compile (step 3 above):
<div class="org-src-container">

<pre class="src src-sh">make -j6
</pre>
</div>
<p>
I'm compiling with 6 cores of my processor. You can choose less!
Time for coffee and <a href="https://xkcd.com/303/">games</a>!
</p>
</li>
<li>Install the compiled code in the <code>root-6.04.06-install</code>
directory (step 4 above)
<div class="org-src-container">

<pre class="src src-sh">make install
</pre>
</div>
</li>
<li>That's it! root is installed!
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Wrapping Up</h2>
<div class="outline-text-2" id="text-6">
<p>
You just need to tell linux where to find root now. Root does the
hard work for you here. Just put the following in your <code>.bashrc</code>
file:
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b0c4de;">source</span> /opt/root/root-6.04.06-install/bin/thisroot.sh
</pre>
</div>
<p>
Now log out, log back in, and get to work!
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2015-10-27</p>
<p class="author">Author: Richard Longland</p>
<p class="date">Created: 2015-10-27 Tue 12:39</p>
<p class="creator">Emacs 24.3.1 (Org mode 8.2.4)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
